// Домашка 6
// Задание 1
// Дан массив: 
// [1, 5, 4, 10, 0, 3].

// Создайте цикл, который будет выводить элементы массива до тех пор, пока не встретит значение 10. После вывода значения 
// 10 в консоль цикл должен прекратить свою работу.

const numbs = [1, 5, 4, 10, 0, 3];
for (let i = 0; i < numbs.length; i++) {
    console.log(numbs[i]);
    if (numbs[i] === 10) {break;
    }  
}

// Задание 2
// Дан массив: 
// [1, 5, 4, 10, 0, 3].

// Найдите индекс значения 4 в этом массиве.
 
const arr = [1, 5, 4, 10, 0, 3];
for (let i = 0; i < arr.length; i++) {
    if (arr[i] === 4) {
        console.log(i);
        break;  
    } 
}

const arr16 = [1, 5, 10, 0, 4, 3];
console.log(arr16.indexOf(4));

// Задание 3
// Дан массив чисел: 
// [1, 3, 5, 10, 20].

// С помощью метода 
// join выведите элементы массива через пробел (пустую строку 
// ' ').

const arr1 = [1, 3, 5, 10, 20];
console.log(arr1.join(' '));

// Задание 4
// С помощью вложенных циклов создайте многомерный массив вида: 
// [[1, 1, 1], [1, 1, 1], [1, 1, 1]].

let arr2 = [];

for (let i = 0; i < 3; i++) {
    const arr3 = [];
    for (let i = 0; i < 3; i++){
        arr3.push(1)
    }
    arr2.push(arr3);
}
console.log(arr);

// Задание 5
// Дан массив: [1, 1, 1]. Добавьте в конец массива значения 2, 2, 2.
let arr4 = [1, 1, 1];

arr4.push(2, 2, 2);
console.log(arr4);

// Задание 6
// Дан массив: 
// [9, 8, 7, 'a', 6, 5].

// С помощью метода sort
// отсортируйте массив и удалите букву 'a'
// из массива. Затем выведите массив.

const arr5 =  [9, 8, 7, 'a', 6, 5];
let array = arr5.sort((a, b) => a - b);
const newArray = array.filter(item => item !== 'a');
console.log(newArray);

// Задание 7
// Дан массив: [9, 8, 7, 6, 5].

// Попросите пользователя угадать число с помощью метода prompt.
//  Если значение, которое ввел пользователь, есть в массиве, выведите 
//  в alert «Угадал», в противном случае — «Не угадал».


const arr6 = [9, 8, 7, 6, 5];
let num = +prompt('Угадай число');

if (arr6.includes(num)) {
alert('Угадал');
}
else {
    alert('Не угадал');
}

// Задание 8
// Дана строка: 'abcdef'. Выведите в консоль 'fedcba'.

// Для этого задания вам пригодится метод 
// reverse(). Он располагает элементы массива в порядке, обратном исходному.
let word = 'abcdef';
console.log(word.join(reverse(split(''))));

// let word = 'abcdef';
// word = word.split('');
// console.log(word);
// word.reverse();
// word = word.join('');
// console.log(word);


// Задание 9
// Дан массив: 
// [[1, 2, 3],[4, 5, 6]]. 
// Выведите в консоль массив вида: 
// [1, 2, 3, 4, 5, 6].

const arr7 = [[1, 2, 3],[4, 5, 6]];
const newArr = [];
 
for (let i = 0; i < arr7.length; i++) {
    newArr.push(...arr7[i]);
}

console.log(newArr);

const arr15 = [[1, 2, 3],[4, 5, 6]];
console.log(arr15.flat());

// Задание 10
// Создайте массив с произвольными числами (диапазон от 
// 1
//  до 
// 10
// ).
// Переберите его с помощью цикла 
// for
// .
// В каждой итерации выведите в консоль сумму текущего и следующего элементов массива.
// Следующий элемент массива можно получить с помощью индекса: 
// i + 1
// . Обратите внимание, что у последнего элемента нет следующего.


// Критерии оценки
// Подсказка
// Используйте цикл 
// for
//  для перебора элементов и вычисления суммы. Учтите, что для последнего элемента нет последующего!

const arr8 = [2, 9, 5, 7, 10];
for (let i = 0; i < arr.length; i++) {
    // const summ = arr8[i] + arr8[i + 1];
    // console.log(summ);
    if (arr8[i + 1]){
    console.log(arr8[i] + arr8[i + 1]);
    }
}

// Задание 11
// Создайте функцию, которая принимает на вход массив целых чисел, а возвращает массив квадратов этих чисел.
function square(arr9) {
  return arr9.map(item => item ** 2);
}
console.log(square([1, 2, 3]));

// Задание 12
// Создайте функцию, которая принимает на вход массив строк, а возвращает массив длины слов.

function strLenght(arr10) {
    return arr10.map(item => item.length);
}
console.log(strLenght(['Биба', 'и', 'Боба']));

// Задание 13
// Создайте функцию, которая принимает на вход массив целых чисел, а возвращает массив, содержащий только отрицательные значения.


// Критерии оценки
// Подсказка
// Используйте метод 
// filter()
//  для создания нового массива на основе условия проверки отрицательности числа.

function negativeValue(arr11) {
  return arr11.filter(item => item < 0);
}
console.log(negativeValue([1, -5, 2, 3, -356]));

// Задание 14
// Создайте массив, состоящий из 10 значений. Значения массива необходимо сгенерировать с помощью метода 
// Math.random()
//  в диапазоне от 0 до 10.

// В данном массиве найдите все четные значения и добавьте их в новый массив. Результат работы программы необходимо вывести в консоль — это будут два массива: исходный массив и массив с четными значениями.

function randomNumb() {
    return Math.floor(Math.random() * 10);
}

let arr12 = [];
for (let i = 0; i < 10; i++) {
    arr12.push(randomNumb());    
}
let evenArr = [];
for (let i = 0; i < arr12.length; i++) {
    if (arr12[i] % 2 === 0) {
    evenArr.push(arr12[i]);
    }
}
console.log(evenArr);

// Задание 15
// Создайте массив, состоящий из 6 элементов. Элементы массива необходимо сгенерировать с помощью 
// Math.random()
//  в диапазоне от 1 до 10.

// Требуется найти среднее арифметическое этих цифр, результат программы вывести в консоль.
function randomNumb() {
    return Math.floor(Math.random() * 10);
}
let arr14 = [];
for (let i = 0; i < 6; i++) {
    arr14.push(randomNumb());    
} 
console.log(arr14);  
let sum = arr14.reduce((total, num) => total + num);
let average = sum / arr14.length;
console.log(average); 